{"scene": 1, "summary": "A black screen appears with white text, accompanied by the sound of buzzing bees. The narrator states, \"According to all known laws of aviation, there is no way a bee should be able to fly. Its wings are too small to get its fat little body off the ground.\" The narrator continues, \"The bee, of course, flies anyway because bees don't care what humans think is impossible.\"", "connection": "This scene serves as the introduction to the movie and sets up the core theme of defying expectations. It foreshadows Barry's actions later in the film, as he also will defy 'known laws'. This opening also establishes a sense of whimsy and the bees ability to go against all odds."}
{"scene": 2, "summary": "Barry is seen in his room picking out a shirt. He is looking at options of \"Yellow, black\" before deciding to mix up the pattern, choosing \"black and yellow\" and stating, \"Ooh, black and yellow! Let’s shake it up a little\". Janet calls him for breakfast. Barry uses his antennae like a phone, to speak to Adam, and states, \"I can’t believe this is happening\". Barry then flies down the stairs. Martin says, \"Looking sharp\", and Janet says, \"Use the stairs, your father paid good money for those.\" Barry says he is excited. Martin says, \"Here’s the graduate, we’re very proud of you, son. A perfect report card, all B’s\". Janet says that she is proud and rubs his hair, and Barry replies with \"Ma! I got a thing going here\". Janet says, \"You got lint on your fuzz\", and Barry says, \"Ow! That's me!\". Janet then states, \"Wave to us! We'll be in row 118,000, Bye!\", as Barry flies out of the door.", "connections": "This scene introduces Barry, his relationships, and his slight non-conformist attitude. His unique shirt choice hints at his rebellious nature, while his interactions with his family highlight his established life and the expectations that come with it. It also introduces his relationship with Adam."}
{"scene": 3, "summary": "Janet tells Barry to stop flying in the house. Barry drives his small car through the hive and waves to Adam, who is reading a newspaper. Adam asks if he is using \"fuzz gel,\" and states that he never thought he would make it to graduation. Barry talks about his time in grade school, high school, college, and his day of hitchhiking and Adam replies with \"You did come back different\". They then pass Artie, who is jogging and is growing a mustache. Adam asks if he has heard about Frankie. Barry states he's not going to the funeral because \"everybody knows, sting someone, you die\". He also states, \"Don’t waste it on a squirrel, such a hothead\". Adam states that he could have just gotten out of the way. The car then does a barrel roll over a loop-shaped bridge, and lands on the highway. Barry says that he loves how they incorporate an amusement park into their regular day. He then states that they don’t need vacations. They park the car and fly over the graduating students. Barry states, \"Boy, quite a bit of pomp, under the circumstances\" before they put on their hats and sit down. Barry states, \"Well, Adam, today we are men\", and Adam says, \"we are!\". Barry says \"Bee-men\" and Adam replies \"Amen!\" before they both have a spasm.", "connections": "The scene builds upon Barry's character, showing him as laid back and questioning the need for structured societal traditions. The discussion about Frankie’s death sets a rule of the bee world \"sting someone you die\". The mention of not needing vacations establishes how the bee society is structured. This scene also highlights the difference between Barry's and Adam’s personalities."}
{"scene": 4, "summary": "An announcer says \"Students, faculty, distinguished bees, please welcome Dean Buzzwell.\" Dean Buzzwell welcomes them to graduation and states that this concludes their ceremonies and begins their career at Honex Industries. Adam asks if they are picking their job today, and Barry says it's just orientation. They get on a tour bus, and the tour guide welcomes them to Honex. The guide states that \"we know that you as a bee, have worked your whole life to get to the point where you can work for your whole life.\" She states \"honey begins when our valiant Pollen Jocks bring the nectar to the hive. Our top-secret formula is automatically color-corrected, scent-adjusted and bubble-contoured into this soothing sweet syrup, with its distinctive golden glow you know as...\". Everyone replies \"honey!\" The tour guide then throws honey into the crowd and it is caught by a girl in the back. Adam states that she was hot, and Barry replies with, \"She’s my cousin!\" and that they are all cousins. The tour guide then states that at Honex they strive to improve every aspect of bee existence, and the bus passes by bees stress testing helmets. The bus then drives by bees on a turning wheel and a tour guide states that it is the Krelman and that it catches the strand of honey that hangs after pouring it. She then states \"But choose carefully because you will stay in the job you pick for the rest of your life\". Everyone claps, except for Barry. Barry states, \"The same job the rest of your life? I didn’t know that\", and Adam asks \"What’s the difference?\". The tour guide states that bees haven't had one day off in 27 million years. Barry is upset and asks, \"So you’ll just work us to death?\" and the tour guide replies, \"We’ll sure try\". Everyone laughs except for Barry.", "connections": "This scene introduces Honex Industries, the central location for the bee’s professional lives. It is also the turning point for Barry, when he is told that he has to choose a job for the rest of his life. This scene directly sets up the main conflict that Barry faces in the film."}
{"scene": 5, "summary": "Adam says \"Wow, that blew my mind!\". Barry questions the phrase \"what's the difference?\". He states, \"One job forever? That's an insane choice to have to make\". Adam says \"I'm relieved, now we only have to make one decision in life.\" Barry asks how they never told them that. Adam states, \"Why would you question anything, we’re bees, we’re the most perfectly functioning society on earth\". Barry asks if he thinks things work a little too well here and Adam asks for an example. They stop walking, and it is shown that cars are speeding by them in perfect unison. Barry states, \"I don’t know, but you know what I'm talking about\". The announcer states \"please clear the gate, royal nectar force on approach\". Barry then states to check it out and reveals the Pollen Jocks flying in. He states, \"Hey, those are Pollen Jocks!\" and Adam says he's never seen them that close. Barry says they know what it’s like outside the hive, but Adam says some of them don't come back. Girl bees are shown greeting the Jocks as they land and hook up their backpacks. Lou Lo Duva then says, \"You guys did great! You’re monsters! You’re sky freaks! I love it!\" and punches them all. Adam asks where they were. Barry replies he doesn't know, but that their day’s not planned. He then states, \"You can’t just decide to be a Pollen Jock, you have to be bred for that.\" Adam replies \"Right\". Barry and Adam are shown with pollen on them.", "connections": "This scene shows Barry’s dissatisfaction with the structured life of the bee society, and his growing interest in the freedom that the Pollen Jocks seem to have. This scene also further highlights the differences between Barry and Adam's views on life."}
{"scene": 6, "summary": "Barry states that the Pollen Jocks have more pollen than they will see in a lifetime. Adam says, \"It’s just a status symbol. Bees make too much of it\". Barry replies that might be the case, but the ladies see you wearing it. He then waves to two girl bees and Adam asks if they aren’t their cousins. Barry says \"Distant, distant\". Pollen Jock #1 and #2 are talking about them and call them \"couple of hive Harrys\", and they state that they should have some fun with them. A girl bee states that it must be dangerous being a Pollen Jock. Barry then lies about fighting a bear that pinned him to a mushroom and was slapping him. The girl then asks what Adam was doing, and he replies with trying to alert the authorities. Barry says he can autograph it. The Pollen Jocks walk up to them and pretend that Barry and Adam are Pollen Jocks. They ask if it was gusty out there and that they are hitting a sunflower patch 6 miles from here tomorrow. They then challenge Barry, saying \"A puddle jump for us, but maybe you're not up for it. We’re going 0900 at J-Gate. What do you think, buzzy boy, are you bee enough?\". Barry says, \"I might be. It all depends on what 0900 means.\" The scene transitions to Barry looking at the hive from his balcony at night.", "connections": "This scene shows Barry becoming more fascinated by the Pollen Jocks and wanting to emulate their lifestyle. The challenge that they give him also sets up his decision to leave and try to become a Pollen Jock. This scene also shows how Barry will lie to try and impress others."}
{"scene": 7,"summary": "Martin appears and says “Hey, Honex!”, and startles Barry. Martin asks if Barry decided what he is interested in. Barry says there are many choices but that he only gets one, and then he asks his father if he ever gets bored doing the same job every day. Martin starts to tell him about how great stirring is and says “you get yourself into a rhythm. It’s a beautiful thing”. Barry says, that the more he thinks about it, “maybe the honey field just isn’t right for me”. Martin then asks what he was thinking about, and states making balloon animals is a bad job for a guy with a stinger. He yells “Janet, your son’s not sure he wants to go into honey!” Janet says that Barry is funny sometimes, and Barry says “I’m not trying to be funny!”. Martin then says he’s not funny, and that he is going into honey, and that he will be “our son, the stirrer!”. Janet asks, “you’re going to be a stirrer?”, and Barry yells “No one’s listening to me!”. Martin says wait till you see the sticks he has. Barry then says he could say anything right now, and he’s going to get an ant tattoo. Martin says to open some honey and celebrate. Barry says that he might shave his antenna, shack up with a grasshopper, and call everyone dawg. Janet says she’s so proud and it cuts to Barry and Adam in line to get a job.","connections": "This scene is directly about Barry’s resistance to the structure of the bee society. It also highlights his relationship with his parents and their inability to hear him out."}
{"scene": 8, "summary": "Adam is shown in the courtroom, showing the jury how to make paper boats. They are all confused, as Judge Bumbleton states, \"Mr. Flayman\". Adam is still trying to stall, stating that it’s interesting that bees are trained to fly haphazardly and it results in them not making good time, and starts telling a funny story, before Montgomery interrupts him. He states that the bugs have taken enough of their time and states they have presented no compelling evidence. He moves for a dismissal of the case. Judge Bumbleton says she will consider his motion. Adam then states they have a terrific case. Montgomery says \"where’s your proof, where’s the evidence? Show me the smoking gun!\" Barry then flies in through the door and says \"Hold it, your honor! You want a smoking gun? Here is your smoking gun\", and Vanessa is shown entering with a bee smoker.", "connections": "This scene highlights the importance of Adam as he stalls for Barry, but his plan is unsuccessful. The entrance of Barry with the bee smoker sets up the next big event that will turn the case back to the bees."}
{"scene": 9, "summary": "A pollen jock says, \"Alright, we've got the sunflower patch in quadrant 9…\" Adam is seen on the phone with Barry asking what happened and where he is. Barry replies that he is going out. Adam asks out where? Barry replies, \"Out there.\" Adam replies, “Oh, no!\" Barry states, “I have to, before I go to work for the rest of my life.” Adam says \"You're gonna die, you're crazy!\" and Barry hangs up. Then pollen jock #2 is heard saying, “another call coming in. If anyone is feeling brave there’s a Korean Deli on 83rd that gets their roses today.” Barry is shown approaching the Pollen Jocks. Pollen Jock #1 says \"look at that,\" and Pollen Jock #2 says \"Isn’t that the kid we saw yesterday?\" Lou Lo Duva says \"Hold it son, flight deck's restricted.\" Pollen Jock #1 states \"It’s ok Lou, we’re gonna take him up.\" Lou Lo Duva asks Barry if he’s feeling lucky. A bee with a clipboard then has Barry sign a waiver and Lou Lo Duva states “You’ve got a rain advisory today, and as you all know, bees cannot fly in rain. So be careful. As always watch your brooms, hockey sticks, dogs, birds, bears and bats. Also I got a couple of reports of root beer being poured on us Murphy’s in a home because of it babbling like a cicada!”. Lou also reminds the rookies that Bee Law number one is “absolutely no talking to humans!” and then says, “Alright, launch positions!” The pollen jocks run into formation yelling “buzz, buzz” in a sequence. Lou Lu Duva says “Black and Yellow!”. The other pollen jocks say, “Hello!”. Pollen Jock #1 asks if Barry is ready, and Barry says bring it on. They then go through their pre flight check list and Barry says, “Scared out of my shorts check”. Lou Lu Duva then says “OK ladies, let’s move it out! Pound those petunias, you striped stem suckers! All of you drain those flowers!\" The Pollen Jocks then fly out.", "connections": "This scene shows Barry actively defying the structure of the bee world. He is ignoring his duties and is now breaking a very important rule that was told to him. This sets up his first journey as a Pollen Jock."}
{"scene": 10, "summary": "Barry is shown flying as a Pollen Jock, stating “Wow! I’m out! I can’t believe I’m out! So blue. I feel so fast and free! Box kite!” as he flies through one. Barry then states, \"Wow! Flowers!\". Pollen Jock #1 is then shown using high-tech goggles that show the different flowers. Pollen Jock #1 says, “This is blue leader, we have roses visual. Bring it around 30 degrees and hold.” He then says “Roses!”. The Pollen Jock states, “30 degrees roger, bringing it around. Stand to the side, kid, it’s got a bit of a kick”. He then shoots a flower and collects the nectar. Barry states, “That is one nectar collector”. Pollen Jock #1 asks “Ever see pollination up close?” and Barry says, no sir. Pollen Jock #1 says he will pick up some pollen here and sprinkle it over there, and a pinch on that one and states “see that? It’s a little bit of magic”. Barry says that’s amazing and asks why they do that. Pollen Jock #1 says that’s pollen power, more pollen, more flowers, more nectar, more honey for us. Barry says, “cool” and Pollen Jock #1 says that he is picking up bright yellow which could be daisies, and asks if they need them. Pollen Jock #2 says “copy that visual, wait, one of these flowers seems to be on the move”. He states “say again, you’re reporting a moving flower?” And Pollen Jock #2 says “Affirmative”. They land next to the flowers, which are revealed to be tennis balls.", "connections": "This scene shows Barry experiencing the world outside of the hive and that he finds it very amazing and beautiful. It also sets up the major conflict with the tennis balls that will cause Barry to be launched away from the Pollen Jocks and into the human world."}
{"scene": 11, "summary": "Ken is heard yelling \"That was on the line!\" The Pollen Jocks are inspecting the tennis balls. Pollen Jock #1 says \"This is the coolest. What is it?\" Pollen Jock #2 says he doesn’t know but that he is loving the color and that it smells good, but not like a flower and states that it is fuzzy. Pollen Jock #1 says “yeah, fuzzy” and he puts his hand on the ball and it gets stuck. Pollen Jock #3 states, “chemical-y”. Pollen Jock #1 warns the others that it is grabby. The pollen jocks then see that Barry is lying on top of a tennis ball. They yell at him to get off before Pollen Jock #1 notices a human hand coming down and says “problem!” The hand grabs the tennis ball with Barry still on it. Vanessa is then shown bouncing Barry with the tennis ball while the Pollen Jocks state \"This could be bad\" and Barry is yelling, \"Very close. Gonna hurt. Mama's little boy”. He then flies out of view after Ken yells, \"Coming in at you like a MISSILE!\" The Pollen Jocks state \"I don't think these are flowers,\" and, \"Should we tell him?\", before Pollen Jock #1 states, \"I think he knows\".", "connections": "This scene is a direct continuation of the previous scene and it directly sets up the situation that takes Barry into the human world and away from the other bees."}
{"scene": 12, "summary": "Ken is yelling “Match point! You can start packing up, honey, because you’re about to EAT IT!” and he hits the tennis ball that has Barry on it the wrong way. Barry yells, “Yowser!”. Barry then bounces off several surfaces, getting stuck inside the engine of a car. He then is blown into the car's air conditioner and sees a frozen bug. The man driving the car turns on the air conditioner and it blasts Barry into the car. A girl in the car says “There’s a bee in the car! Do something!” and the dad says, “I’m driving!”. A baby girl waves at Barry and he waves back. A guy in the back of the car says that he is going to sting him. A girl says “Nobody move. If you don’t move, he won't sting you. Freeze!”. They are all frozen still when a grandma in the car says “He blinked!”. She then sprays bee spray all over the car while trying to get Barry. The dad says, “What are you doing?!”. Barry then escapes through the air conditioner.", "connections": "This scene sets up the chaos and unpredictability of the human world. It also sets up the reason for Barry's crash landing and the meeting with Vanessa, in the next scene."}
{"scene": 13, "summary": "Barry, flying above the ground, notes the \"tension level out here is unbelievable\". He sees storm clouds gathering and a raindrop hits him, damaging his wing. Another raindrop hits him, and he spirals downward yelling, \"Mayday! Mayday! Bee going down!\" He crashes into a plant inside an apartment. Inside the apartment, Vanessa asks Ken to close the window. Ken then shows off his resume, which is a brochure. Ken closes the window and Barry says \"Oh, no. More humans. I don't need this,\" before smashing into the glass. He doesn't understand what the glass is, stating, “That is diabolical”.", "connections": "This scene continues the chaos of Barry being in the human world. It introduces the concept that bees cannot fly in the rain and also sets up his meeting with Vanessa inside the apartment, highlighting his inability to understand the human world."}
{"scene": 14, "summary": "Inside Vanessa's apartment, Ken brags about his resume brochure, while Andy asks if his number one movie is Star Wars. Ken then makes finger gun sounds and says he doesn't go for \"that kind of stuff.\" Barry, looking at the light, says that there is the sun and flies towards it, before hitting the lightbulb. He falls onto the table and gets scooped up by Andy with dip. Ken then freaks out and says, \"Stand back, these are winter boots\" and puts them on his hands. He is about to smash Barry but Vanessa saves him.", "connections": "This scene introduces Ken as an antagonistic force, highlighting his bizarre personality. Barry's confusion about the lightbulb shows how unfamiliar he is with the human world. The way Vanessa saves Barry from Ken plants a seed of admiration in Barry’s mind for Vanessa and directly leads into the next scene."}
{"scene": 15, "summary": "Vanessa states \"Wait! Don't kill him!\" and puts Barry in a glass to protect him. Ken states he’s allergic and that it could kill him. Vanessa asks “Why does his life have less value than yours?”, and Ken asks “Why does his life have any less value than mine?”. Vanessa says that all life has value and that they don’t know what he’s capable of feeling. She picks up Ken's brochure and puts it under the glass to carry Barry to the window. Barry looks at Vanessa in amazement, and she lets him out the window. Barry stays back, shocked that a human saved him. Ken states that he is not scared of him and it’s an allergic thing. Vanessa says put it on his resume. Andy suggests to make “knocking someone out” a special skill. Ken walks to the door, before asking Vanessa if they are still on for yogurt night. She says, “Sure, Ken, you know, whatever”. Ken states that they can add carob chips and Vanessa says “Bye” before closing the door. He then opens it again, stating that it's supposed to be less calories, and Vanessa again says “Bye”. The scene fast forwards to the next day when Barry is in the kitchen.", "connections": "This scene shows that Vanessa values all life, which greatly impacts Barry’s perspective on humans. Her actions are in direct contrast to Ken's, setting up why Barry would gravitate towards her. Vanessa's actions set up his internal conflict and his eventual choice to seek out Vanessa."}
{"scene": 16, "summary": "Barry is talking to himself, saying he has to say something because Vanessa saved his life. He thinks about what to say, and realizes he is not supposed to talk to a human. He disguises himself with a food can, before stating that he has to do it. He does several weird poses while telling himself to speak. He then sees her and says “Hi!”. Vanessa drops the dishes she is holding in shock. Vanessa says “You’re talking!” and Barry says “Yes, I know, and I’m so sorry”. Vanessa says “No it’s ok, it’s fine. I know I’m dreaming. But I don’t recall going to bed”. Barry says “well I’m sure this is very disconcerting”. Vanessa says it’s a surprise because he is a bee. Barry states he isn’t supposed to be doing this, but they were all trying to kill him, and if it wasn't for her, he “had to thank her, it's just how I was raised”. She stabs her hand with a fork to see if she is dreaming and Barry says “That was a little weird”. Vanessa says, “I’m talking with a bee. I’m talking to a bee, and the bee is talking to me!” Barry states that he is grateful and turns to leave, before Vanessa says, “Wait! How did you learn to do that?”.", "connections": "This scene solidifies Barry’s decision to break the bee law, as he is driven by gratitude and an internal desire for something more. It also starts the bond between him and Vanessa."}
{"scene": 17, "summary": "Vanessa asks how he learned to talk, and Barry says he learned it the same way she did, and lists “Mama, Dada, Honey. You pick it up”. Vanessa states that it’s funny and Barry says, “Bees are funny. If we didn’t laugh we’d cry with what we have to deal with”. Vanessa then asks if she can get him something, and then suggests coffee. Barry states he doesn’t want to put her out. Vanessa says “Don’t be ridiculous, it takes two minutes”. Barry says he hates to impose, before finally saying, he’d love a cup. Vanessa asks if he wants rum cake, and Barry says he shouldn’t. Vanessa states “Have some!” and Barry states that he can’t, he’s trying to lose a couple micrograms. Vanessa asks where. Barry replies “these stripes don’t help”. Vanessa states he looks great. Barry then questions if she knows anything about fashion, and then asks if she’s alright after she pours the coffee all over the floor. She says, \"No.\" The scene then fast forwards to Vanessa and Barry sitting on the roof drinking coffee.", "connections": "This scene builds the rapport between Barry and Vanessa as they bond over their differences and similarities, and their shared humor. This scene also allows for Barry and Vanessa to show they have similar views on life."}
{"scene": 18, "summary": "Barry is telling a joke, but Vanessa is confused. She asks if that’s a bee joke and Barry states that’s the kind of stuff they do. Vanessa says “yeah, different”. She then asks him what he’s going to do with his life, and Barry replies that he doesn't know, but that he can’t do what they want him to do. Vanessa says that she knows how he feels and that her parents wanted her to be a lawyer or a doctor, but she wanted to be a florist. She says her only interest is in flowers. Barry says that their new queen was just elected with that same campaign slogan. Barry points to the tree and shows Vanessa his hive. She states he’s in Sheep Meadow, and that she lost a toe ring there once. Barry asks, “Why do girls put rings on their toes?”. Vanessa asks, “Why not?”. Barry says it’s like putting a hat on your knee, and Vanessa replies with “Maybe I’ll try that”. A custodian looks over and appears to think that Vanessa is talking to a cup of coffee, and asks if she is alright, and Vanessa says yes, that she is just having two cups of coffee.", "connections": "This scene solidifies the bond between Barry and Vanessa. They are both struggling with their prescribed societal expectations. It is a scene that builds on their connection and shared interests in life and shows that they are both searching for something different."}
{"scene": 19, "summary": "Barry states this has been great and thanks Vanessa for the coffee, and says he is sorry he couldn’t finish it because he would be up for the rest of his life. He then asks for a piece of rum cake and Vanessa gives him a crumb. He states, \"Thanks! Yeah.\", before he says he guesses he'll see her around or not. Vanessa then replies \"OK, Barry\". Barry then thanks her again for before, and Vanessa says, \"That was nothing,\" and Barry states, \"Well, not nothing, but...anyway.\" Barry and Vanessa hold hands, but Vanessa only holds one finger out for Barry. The custodian sees this and thinks Vanessa is laughing at the coffee before falling off of the ladder. The scene fast forwards to two bee scientists testing a parachute and then to Barry and Adam walking.", "connections": "This scene showcases the first romantic undertones of Barry and Vanessa and highlights the start of their bond and closeness, as well as how Barry views Vanessa as being different from other humans. This also serves as a transition to the next scene with Adam."}
{"scene": 20, "summary": "Adam states “Sounds amazing” and Barry says that “It was amazing, it was the scariest, happiest moment of my life”. Adam is in shock at the fact that he was with humans. He asks what they were like, and Barry states “huge and crazy, they talk crazy, they eat crazy giant things, they drive crazy”. Adam asks if they try and kill you like on tv, and Barry states some do but some don't. Adam asks how he got back and Barry says “poodle”. Adam says “You did it, and I’m glad. You saw whatever you wanted to see, you had your experience, now you can pick out your job and be normal.” Barry replies with, “Well…” Adam then says “Well?” Barry says that he met someone. Adam asks if she was bee-ish or if she was a wasp and Barry says no, no, no not a wasp. Adam then asks if she was a spider and Barry states, “I’m not attracted to spiders, I know for everyone else it’s the hottest thing, with the eight legs and all, but I can’t get by that face”. Adam then asks, “So who is she?”, and Barry replies with “She’s… human”. Adam is shocked and states “No, no, that’s a bee law, you wouldn’t break a bee law!” Barry replies, \"Her name is Vanessa.\" and Adam is seen putting his head in his hands and saying, “oh boy”. Barry says, “She’s so nice, and she’s a florist!”. Adam is even more shocked, and states that “you’re dating a human florist!”. Barry says that they are not dating and Adam states, “You’re flying outside the hive, talking to humans that attack our homes with power washers and M-80s! That’s one-eighth of a stick of dynamite!”. Barry then replies, “She saved my life! And she understands me.” Adam then says “This is over!”. Barry then offers him a piece of the crumb he got from Vanessa. Adam then eats it and his tone changes and he says “This is not over! What was that?”. Barry says “They call it a crumb” and Adam replies that it was “so stingin stripey!”. Barry says that’s not what they eat, that’s what falls off of what they eat and asks if he knows what a Cinnabon is. Adam says “no” and Barry is then pulled inside. Adam states “Be Quiet!” and that, “We are not them! We’re us. There’s us and there’s them!”. Barry then says, “Yes, but who can deny the heart that is yearning?” Adam says, “There’s no yearning, stop yearning, listen to me, you’ve got to start thinking bee, my friend! Thinking Bee!”. Barry repeats \"Thinking Bee\", and a worker bee repeats it, followed by several more bees.", "connections": "This scene showcases Barry's clear disregard for the bee laws and traditions, as he is more invested in his relationship with Vanessa. It highlights the growing divide between him and Adam, as Adam's inability to understand his viewpoint highlights the differences in their characters, before Adam tries to pull him back to the bee world by yelling “Thinking bee”."}
{"scene": 21,"summary":"Janet finds Barry floating on a raft in a honey pool. Martin asks Barry what his problem is and Barry sarcastically replies “I gotta start thinking bee?”. Martin says it’s been three days and asks why he isn’t working. Barry states he has life decisions to make. Martin says “What life? You have no life. You have no job. You're barely a bee!”. Janet asks if it would kill him to make honey. Barry then falls into the honey pool and starts to daydream about a picnic with Vanessa, where they are clinking glasses filled with honey, and they laugh after she kills a mosquito. Barry sees her get into a yellow plane and then he also flies. Vanessa then crashes the plane and Barry wakes up back in the honey. Martin states, “We’re still here.” and Janet says, “I told you not to yell at him”. Barry says he has to leave to meet a friend, and Janet states, \"A girl? Is this why you can't decide?\" Barry flies out the door. Janet says “I just hope she’s bee-ish”. The scene then transitions with a time skip, and Barry is sitting on Vanessa’s shoulder at her shop as she’s closing.","connections":"This scene showcases Barry's internal conflict between his responsibilities and his desires by contrasting his daydream and reality, and setting up his relationship with Vanessa."}
{"scene": 22,"summary":"Barry and Vanessa are talking about the Pasadena Tournament of Roses parade. Barry is confused by this and states, \"Do the roses compete in athletic events?\". Vanessa answers no and asks why he doesn’t fly everywhere, to which he responds that it’s exhausting. Vanessa asks why she doesn’t run everywhere if it’s faster. Barry then states “TiVo, you can just freeze live tv, that’s insane!”. Vanessa asks if he doesn’t have that. Barry says that they have Hivo which is a disease. A human walks by and says “Dumb bees!” and Vanessa asks him if he wants to sting all those jerks. Barry states that they try not to sting because it’s usually fatal for them. Vanessa says that he has to watch his temper, and they walk into a store. Barry states that you have to “kick a wall, take a walk, write an angry letter and throw it out”, which is how they deal with emotions like anger, jealousy and lust. Hector then hits Barry off Vanessa’s shoulder, and Vanessa yells at Hector, stating “What’s wrong with you?! He’s not bothering anybody. Get out of here you creep!”, and then hits Hector with the magazine. Barry then asks “What was that? A Pic N Save circular?”, and she states “Yeah it was. How did you know?”. Barry replies, “It felt like about 10 pages, 75 is pretty much our limit.”, while Vanessa states he's got it down to a science. Barry states that he lost a cousin to Italian Vogue.","connections":"This continues to build on Barry and Vanessa’s shared bond. It introduces Hector again and sets up the scene where he will discover the honey in the store and also showcases the danger that bees face in the human world."}
{"scene": 23,"summary":"Barry is shocked to see honey being sold in the store. He sees the brands like “Cute Bee” and “Ray Liotta Private Select”. He asks why is this here and Vanessa states it’s for people who eat it. Barry asks if they don’t have enough food and Vanessa states that they do. He asks how humans get it and she says \"bees make it\". He then exclaims “I know who makes it! And it's hard to make it! There's heating, cooling, stirring. You need a whole Krelman thing!”. Vanessa states that it's organic. Barry replies \"It’s our-ganic!”. Vanessa states that it’s just honey, and Barry replies with “Just what? Bees don’t know about this! This is stealing! A lot of stealing! You've taken our homes, schools, hospitals! This is all we have! And it's on sale? I’m getting to the bottom of this. I'm getting to the bottom of all of this!”. The scene then fast forwards to Barry sneaking into the back room of the store, with black marks on his face. Hector is in the backroom and says, “he is here, I sense it.” and pretends to leave to try and scare Barry. Barry states “You’re busted, box boy!”. Hector states, “I knew I heard something! So you can talk!”. Barry says, “I can talk, and now you’ll start talking! Where are you getting the sweet stuff, who’s your supplier?”. Hector says he thought they were friends and the last thing they would do is upset the bees. Hector grabs a thumb tack and Barry uses his stinger and they sword fight. Hector then says “You’re too late, It’s ours now!”. Barry replies with \"You, sir, have crossed the wrong sword!” and Hector surrenders, stating that “You, sir, will be lunch for my iguana Ignacio!”. Barry asks again where the honey comes from and Hector points to a leaving truck and says “Honey Farms, it comes from Honey Farms!”.","connections":"This scene is a turning point, as Barry finally has a clear motive for his actions - the injustice of the human honey industry. It also sets up the next conflict by introducing Honey Farms and it is a follow up from the previous scene where Barry and Vanessa are in the store."}
{"scene": 24, "summary": "Barry chases after the Honey Farms truck and lands on the windshield, where he is horrified to see a lot of dead bugs. He then hears a whisper and finds Mooseblood, a mosquito, playing dead. Mooseblood tells him to keep still. Barry asks if he is dead and he says, 'Do I look dead?'. Mooseblood says that they will wipe off anything that moves. Barry then says that he is going to Honey Farms and Mooseblood states he is going to Alaska. Another bug playing dead says he's going to Tacoma. Mooseblood states that he’s dead. They then are caught in the windshield wipers and try to hold on. Mooseblood yells 'Why does everything have to be so doggone clean? How much do you people need to see? Open your eyes! Stick your head out the window!'. Barry and Mooseblood then get sprayed off the truck by wiper fluid. Mooseblood yells 'Bee!' and Barry yells 'Moose blood guy!!' Barry screams as he is holding onto the antenna and a water bug is also seen hanging on, and both begin screaming. The truck driver says 'you hear something?' and the guy with him says 'like what?' and the truck driver says 'like tiny screaming', before the guy in the truck says 'turn off the radio.' The antenna goes down and Barry is flung off. He lands inside the horn of the truck, where he finds Mooseblood, who was also flung inside.", "connections": "This scene introduces Mooseblood as another bug who is also experiencing injustice from humans. The windshield and wiper scene shows the danger that the human world poses to insects."}
{"scene": 25, "summary": "Barry and Mooseblood are sitting in the truck's horn. Barry states there were 'Just a row of honey jars, as far as the eye could see.' Mooseblood replies with 'Wow'. Barry assumes that where the truck is going is where they are getting the honey. Mooseblood states, 'bees hang tight,' and Barry replies they are all jammed in, and 'It’s a close community.' Mooseblood says, 'Not us, man. We on our own. Every mosquito on his own.' Barry asks what if you get in trouble, and Mooseblood replies 'You a mosquito, you in trouble. Nobody likes us, they just smack. See a mosquito, smack, smack!'. Barry states that at least he is out in the world and must meet girls. Mooseblood states that mosquito girls try to trade up, get with moths or dragonflies. He then sees a blood donation sign on an ambulance and says, 'You got to be kidding me!' before stating that he is going to leave and says 'So long, bee!'.", "connections": "This scene builds upon the previous one with Mooseblood, and it highlights the differences and similarities between the bee and mosquito societies. It also marks the end of his part in the journey. The fact that they are in the horn, highlights the smallness of the insects in the human world."}
{"scene": 26, "summary": "Barry, now alone, looks around and sees that the truck has arrived at Honey Farms. He sees a beekeeper state, 'A bee's got a brain the size of a pinhead' and another beekeeper stating 'They are pinheads!'. He hears one state 'Check out the new smoker, the Thomas 3000!' and the other states, '90 puffs a minute semi-automatic, twice the nicotine all the tar. A couple breaths of this knocks them right out'. The beekeeper then states 'they make the honey and we make the money'. The beekeepers start spraying the smoker on a multitude of cheap apartment buildings and bees are seen fainting and passing out. Barry then flies into an apartment, and helps a bee couple up who are coughing. Barry then asks 'Do you know you’re in a fake hive with fake walls?'. A bee replies with 'Our queen was moved here. We had no choice'. Barry states, 'This is your queen?', where a photo is shown of a man in women’s clothes. Barry exclaims 'That's a man in women's clothes! That's a drag queen!'. He then goes outside and sees the hundreds of apartments. He then states 'Oh, no. There’s hundreds of them! Bee honey. Our honey is being brazenly stolen on a massive scale! This is worse than anything bears have done! I intend to do something'. The scene then transitions to Barry showing his parents the pictures. Janet says, 'Oh Barry, stop'. Martin asks where he heard about humans taking their honey and calls it a rumor. Barry replies, 'Do these look like rumors?'. Uncle Carl calls it a conspiracy theory and says the photos are doctored. Janet asks how he got mixed up in this. Adam states, 'He’s been talking to humans!'. Janet yells 'What?!', and Martin yells 'Talking to humans?!' and Adam states that he has a human girlfriend, and they 'make out!'. Janet yells 'Make out? Barry!'. Barry replies, 'We do not'. Adam states, 'You wish you could'. Martin asks whose side he is on, and Barry says, 'The bees!'. Uncle Carl states he dated a cricket in San Antonio and her crazy legs kept him up all night. Janet says, 'Barry, is this what you want to do with your life?'. Barry then states 'I want to do it for all our lives! Nobody works harder than bees!'. He states he remembers his dad coming home overworked, and his mom states that she remembers that. Barry states what right do they have to their honey and that bees live on two cups a year and that humans put it in lip balm. Adam says even if it’s true, what can one bee do? Barry replies by saying he will sting them where it really hurts. Martin replies in the face, eye, or nose. Barry says that it's only one place where it matters.", "connections": "This scene confirms Barry's suspicions and fuels his desire to seek justice. It also sets up that his parents are unsupportive and skeptical of his claims. This scene sets the path for his next step, the lawsuit."}
{"scene": 27, "summary": "The Bee News is introduced with the theme of 'Hive at Five, the hive’s only full-hour action news source.' They show a bee protestor that says, 'No more bee beards!'. Bob Bumble introduces himself and Jeanette Chung. They announce that Barry intends to sue the human race. The scene changes to Bee Larry King interviewing Barry. Larry King asks if he ever thought he couldn’t do it. Barry says that bees have never been afraid to change the world, and he gives the examples of Bee Columbus, Bee Gandhi, and BeeJesus. Larry asks where he is from and that they wouldn't sue humans. Larry also states that the bee community is supporting him in the case, and calls it the trial of the bee century. Barry states that they have a Larry King in the human world too, before describing his physical appearance and actions. Bee Larry King states, 'Bear Week next week, they’re scary, hairy, and here, live' before flying off set in a fit of anger. Barry continues describing the human Larry King, including 'Always leans forward, pointy shoulders, squinty eyes, very Jewish'.", "connections": "This shows that his actions are having a bigger impact than just his personal sphere. It also sets up that Barry is using his knowledge of the human world to make fun of his own kind. This shows Barry's wit and cunning."}
{"scene": 28, "summary": "Vanessa enters her shop, and Ken enters behind her yelling about tennis. Barry tells Ken to be quiet. Vanessa states that she is helping Barry sue the human race. Barry states hello, and Ken mocks him. Vanessa states that he’s Ken and Barry says he remembers him \"Timberland, size ten and a half, Vibram sole, I believe\". Ken questions why Barry is talking again, and Vanessa tells Ken to leave. Ken states it’s yogurt night. Vanessa says bye, and Ken says \"why is yogurt night so difficult?\". After Ken leaves, Vanessa states to Barry that he has been at this for hours. Adam says “Frosting” and asks how many sugars. Barry says just one. He states he tries not to use the competition. Vanessa then asks why they are helping and Barry replies he tries not to use the competition. Vanessa states that bees have good qualities, and that it takes her mind off her shop. She states people are giving balloon bouquets instead of flowers now. Barry says those are great, if you’re three, and Vanessa states artificial flowers are popular too. Barry states, “Oh, those just get me psychotic! Bent stingers, pointless pollination” and Adam replies with “Bees must hate those fake things! Nothing worse than a daffodil that’s had work done!”. Vanessa states that the lawsuit is a pretty big deal, and Adam asks if he is sure he wants to go through with it. Barry says, “Am I sure? When I’m done with the humans, they won’t be able to say “Honey, I’m home” without paying a royalty!”.", "connections": "This continues to build on the tension between Ken and Barry, while it shows Vanessa’s dedication to Barry’s cause. This also highlights that the bee society is supporting Barry's cause while also showcasing his humor in the face of serious issues."}
{"scene": 29, "summary": "The scene transitions to a human news report, showing that people are waiting outside the court house in anticipation to see if a bee can actually talk. The scene transitions to inside the court house where Adam and Barry are talking about their plan. Barry states “It’s pretty big, isn’t it?” and Adam states “I can't believe how many humans don't work during the day”. Barry says “You think billion-dollar multinational food companies have good lawyers?”. Security is then seen telling people to stay behind the barricade. Montgomery gets out of a limo and walks past Barry, and Barry says, “I don’t know, I just got a chill”. A man yells, “all rise!”. Judge Bumbleton is introduced. The judge then starts the case, and states that Barry is representing all bees of the world. Barry makes buzzing sounds and then states \"I'm kidding. Yes, Your Honor, we're ready to proceed\". Montgomery is then asked for his opening statement. He gives a speech about his grandmother, and states how the world would be if bees could talk and he’d have to negotiate with silkworms for the elastic in his britches. He then walks up to Barry and says “Talking bee! How do we know this isn't some sort of holographic motion-picture-capture Hollywood wizardry?”. He then yells about laser beams, robotics, ventriloquism, cloning, and that Barry could be on steroids.", "connections": "This scene transitions the movie into the next setting, showing that the legal battle is becoming the focus. It also solidifies Montgomery's position as the antagonist, who is using scare tactics and absurd claims to dismiss Barry."}
{"scene": 30, "summary": "Judge Bumbleton then asks for Barry’s opening statement. Barry says that there's no trickery and that he’s just an ordinary bee, and honey is important to him and all bees. He states that bees invented it, make it, and protect it with their lives, but there are people who want to take it because they are the \"little guys\". He then says that by taking their honey they are taking everything that they are. Janet says that she wished Barry would dress like that all the time. Judge Bumbleton says call the first witness. Barry then calls Klauss Vanderhayden of Honey Farms to the stand. Barry states that he also owns Honeyburton and Honron. Barry says he finds the term \"beekeeper\" disturbing and asks if he employs any bee free-ers, to which he responds with “No”. Barry states he couldn’t hear him, and Klauss says no. Barry says it’s because he doesn’t free bees, he keeps bees. Barry also states it seems he thought a bear would be appropriate for a jar of honey. Klauss says that bears are very lovable creatures and names several. Barry states, \"You mean like this?\" and then a bear barges through the courtroom. Barry then states “Bears kill bees!”. Barry then calls Mr. Sting to the stand and says his name intrigues him. Sting states that he was with a band called The Police. Barry asks if he has ever been a police officer, to which Sting replies that he hasn't. Barry states that this is another example of bee culture being stolen and calls him Mr. Gordon M. Sumner. Montgomery then states that's not his real name. Barry then calls Ray Liotta to the stand. He congratulates him on his Emmy and says he is \"devilishly handsome with a churning inner turmoil that’s ready to blow\". Ray Liotta states \"I enjoy what I do, is that a crime?\", and Barry replies with \"Not yet it isn't. But is this what it's come to for you? Exploiting tiny, helpless bees so you don't have to rehearse your part and learn your lines, sir?\" Ray Liotta then states “Watch it, Benson! I could blow right now!”. Barry then replies that Liotta isn’t a goodfella, he’s a badfella and Ray Liotta tries to grab Barry. Judge Bumbleton yells \"Order in this court!\", and everyone is talking and yelling.", "connections": "This scene highlights Barry’s ability to command the room and use his knowledge of pop culture to his advantage. It shows that Barry has become comfortable with being on the public stage, and is willing to do what is needed to win the case."}
{"scene": 31, "summary": "Barry states that he thought it was awfully nice of that bear to pitch in like that. Vanessa says she thinks the jury’s on their side. Barry asks if they are doing everything right legally, and Vanessa states she's a florist. Barry says, \"right. Well, here’s to a great team,” and Vanessa repeats. Ken then walks in, looking upset at Barry clinking his glass with Vanessa. Vanessa states “Oh, Ken, I didn’t think you were coming.” and Ken says that he was just late and his battery was dead. Vanessa states that she called Barry since she didn’t want the food to go to waste. Ken states that that was “lucky”. Ken then starts menacingly staring at Barry and Vanessa leaves to heat up some food. Ken states, “Yeah, heat it up, sure, whatever.” Barry then says “So I hear you are quite the tennis player. I’m not much for the game myself. The ball’s a little grabby.” Ken replies that that’s where he usually sits and points at Barry’s seat. Vanessa, calling from another room says, “Ken, Barry was looking at your resume, and he agreed with me that eating with chopsticks isn't really a special skill.” Ken, says “You think I don’t see what you’re doing?”, and Barry states that he knows how hard it is to find a right job and that they have that in common. Ken asks “Do we?” and Barry replies with, “Bees have 100 percent employment, but we do jobs like taking the crud out”. Ken then states, “That’s just what I was thinking of doing”. He then reaches for a fork, but knocks it on the ground. He then gets up and hits his head on the table. Vanessa mentions that Barry borrowed Ken's razor and Ken yells. Barry then states “I’m going to drain the old stinger”, and flies to the bathroom. Ken then freaks out and yells, and splashes his wine on his eyes. Barry is shown looking at the magazine covers of the court case. He then enters the bathroom.", "connections": "This scene highlights the ongoing tension between Barry and Ken, and solidifies Vanessa and Barry’s relationship while also showcasing the jealousy and pettiness that Ken is harboring. This scene also acts as a build up for the bathroom scene."}
{"scene": 32, "summary": "Ken enters the bathroom and closes the door, stating he is tired of Barry’s mind games. He is seen rolling up a magazine, stating it’s “Italian Vogue”. Barry says it’s a lot of pages. Ken replies it’s a lot of ads. Barry then says “Remember what Van said, why is your life more valuable than mine?” Ken says he doesn’t recall that. He smashes everything off the sink and Barry narrowly escapes. Ken is then chasing Barry around the bathroom and getting a spray bottle. He says that something stinks in here. Barry states he loves the smell of flowers, as Ken holds a lighter to the spray bottle. Ken asks how Barry likes the smell of flames. Ken shoots the spray can at Barry, but misses, and lights the bathroom on fire, and loses his footing and falls in the bath tub, he then pulls a shower head and reveals a water bug. Barry is seen in a pile of items wearing a chapstick as a hat, and states “Ken, I’m wearing a chapstick hat! This is pathetic!”. Ken states he’s got issues, and then sprays Barry into the toilet. Ken then looks down into the toilet and says, “Well, well, well, a royal flush!”. Barry then says, “You’re bluffing” and Ken flushes the toilet. Barry then uses the chapstick as a surfboard before flying out and spraying Ken with the toilet water. Barry says “That bowl is gnarly”. Ken then grabs a toilet cleaner and states “Except for those dirty yellow rings!”. Vanessa then runs in before Ken can spray Barry.", "connections": "This scene is a culmination of the building tension between Barry and Ken and highlights Ken’s erratic and unpredictable behavior. It provides a moment of slapstick comedy and it sets up the conflict and conversation between Ken and Vanessa in the following scene."}
{"scene": 33, "summary": "Vanessa yells “Kenneth, What are you doing?!” Ken then says “You know I don’t even like honey, I don’t eat it!”. Vanessa then states that they need to talk, and drags him out of the bathroom. She then says, “He’s just a little bee! And he happens to be the nicest bee I've met in a long time!” Ken replies with “Long time? What are you talking about?! Are there other bugs in your life?”. Vanessa replies with, “No, but there are other things bugging me in life, and you’re one of them!”. Ken states, “Fine! Talking bees, no yogurt night… My nerves are fried from riding on this emotional roller coaster!”. Vanessa says “Goodbye, Ken” and Ken leaves. He then comes back in and stares at Barry and says “And for your information, I prefer sugar-free, artificial sweeteners MADE BY MAN!” He then leaves again and Vanessa says “I’m sorry about all that”. Ken then comes back again and yells, “I know it’s got an aftertaste! I LIKE IT!” and then leaves for good. Vanessa tells Barry that there was always some kind of barrier with Ken that she couldn’t overcome. She asks if Barry is ok for the trial and Barry states he believes that Mr. Montgomery is about out of ideas.", "connections": "This scene brings Ken and Vanessa's relationship to a close and solidifies that they are not compatible. It also sets up the next act of the movie with Barry and Vanessa now closer together, and ready to take on the honey industry in the court room. This also shows how different Vanessa’s personality is, from other humans that Barry has encountered, since she seems more open minded."}
{"scene": 34, "summary": "We see Barry looking at magazine covers of himself, before the scene transitions to court. Montgomery states 'We would like to call Mr. Barry Benson Bee to the stand'. Adam states 'Good idea! You can really see why he’s considered one of the best lawyers' before Barry stares at him and Adam says, 'Yeah'. The lawyer tells Montgomery he needs to weave some magic with the jury. Montgomery states he has to remind them what they don’t like about bees. He asks if he has the tweezers and then states he is only allergic to losing. He then asks Barry about his relationship with Vanessa. Barry states they are friends and Montgomery asks if they are good friends, to which Barry replies yes. Montgomery then asks if they live together, and then states 'Are you her little…bedbug?'. Adam’s stinger is seen to vibrate as he grows more agitated. Montgomery states he has seen bee documentaries and says, 'doesn't your queen give birth to all the bee children?' Barry states yeah, but… before Montgomery interrupts and asks if those aren't his real parents. Janet says, 'Oh, Barry…' and Barry replies, 'Yes, they are!'. Adam then starts trying to get free, as Montgomery says 'You’re an illegitimate bee aren’t you, Benson?'. Adam says, 'He’s denouncing bees!'. Montgomery states, 'Don’t y’all date your cousins?', before leaning over the jury stand, and staring at Adam. Vanessa yells 'Objection!', and Adam gets free and flies towards Montgomery.", "connections": "This is the scene where everything starts to unravel for Barry. Montgomery is trying to get a reaction from Barry, but Adam is the one who gets provoked and it is a direct set up for what happens in Scene 35."}
{"scene": 35, "summary": "Adam stings Montgomery in the butt. Montgomery then starts yelling 'Oh, I’m hit!! Oh lordy I am hit!' as he is thrashing around. Judge Bumbleton is trying to call order to the court as Montgomery continues to overreact. Montgomery then states, 'The venom! The venom is coursing through my veins! I have been felled by a winged beast of destruction! You see? You can't treat them like equals! They're striped savages! Stinging's the only thing they know! It's their way!'. Barry then states, 'Adam, stay with me', and Adam replies 'I can’t feel my legs.' Montgomery continues to overreact stating, 'What angel of mercy will come forward to suck the poison from my heaving buttocks'. Judge Bumbleton says she will have order, and states 'Order, please!'.", "connections": "This is a major turning point that causes the events in the courtroom to become chaotic and for the bee’s to lose credibility and control in the situation. This scene is a direct continuation from the previous scene and sets up the next scene where Adam is in the hospital."}
{"scene": 36, "summary": "A human news reporter is talking about how the bee lawsuit took a pointed turn against the bees when one of their team stung Montgomery. Adam is shown in the hospital with a plastic sword where his stinger should be. Barry states 'Hey Buddy', and Adam says 'Hey'. Barry asks if there is much pain, and Adam says 'yeah, I…I blew the whole case, didn’t I?'. Barry replies 'It doesn’t matter. What matters is you’re alive, you could have died'. Adam replies, 'I’d be better off dead. Look at me.' He then states that they got his stinger from a tuna sandwich and that there is still celery on it. Barry asks what it was like to sting someone. Adam says he can’t explain it and it was 'all…all adrenaline, and then… and then ecstasy!'. Adam asks if it was a trap, and Barry states 'of course. I’m sorry, I flew us right into this'. Adam then states, 'What will the humans do to us if they win?', and Barry states he doesn’t know. Adam states that he heard they put roaches in motels. Barry then states 'Adam, they check in but they don’t check out!' Adam then states 'oh, my', and then coughs, and asks if Barry can get a nurse to close the window because of the smoke. Barry asks why, and he says, 'the smoke. Bees don’t smoke'. Barry says 'right, bees don’t smoke, but some bees are smoking, that’s it!'. Adam states, 'It is? It’s not over?' and Barry says, 'Get dressed, I’ve gotta go somewhere, get back to the court and stall. Stall any way you can'.", "connections": "This scene shows the ramifications of the actions in the courtroom, and also sets up that Adam will be unable to sting again. It also sets up that Barry will make a new plan, since he states 'That’s our case!'."}
{"scene": 37, "summary": "Adam is shown in the courtroom, showing the jury how to make paper boats. They are all confused, as Judge Bumbleton states, 'Mr. Flayman'. Adam is still trying to stall, stating that it’s interesting that bees are trained to fly haphazardly and it results in them not making good time, and starts telling a funny story, before Montgomery interrupts him. He states that the bugs have taken enough of their time and states they have presented no compelling evidence. He moves for a dismissal of the case. Judge Bumbleton says she will consider his motion. Adam then states they have a terrific case. Montgomery says 'where’s your proof, where’s the evidence? Show me the smoking gun!' Barry then flies in through the door and says 'Hold it, your honor! You want a smoking gun? Here is your smoking gun', and Vanessa is shown entering with a bee smoker.", "connections": "This scene highlights the importance of Adam as he stalls for Barry, but his plan is unsuccessful. The entrance of Barry with the bee smoker sets up the next big event that will turn the case back to the bees."}
{"scene": 38, "summary": "Barry asks the court, 'Look at what has happened to bees who have never been asked, 'Smoking or non?' He then asks if this is what nature intended for them. He states 'To be forcibly addicted to smoke machines and man-made wooden slat work camps? Living out our lives as honey slaves to the white man?' He points to the owners and one, who is black, awkwardly steps away from the group. Barry then yells 'Ladies and gentlemen, please, free these bees!' and Adam and Vanessa repeat 'Free the bees!' They also get all of the bees in the court to yell it, and the human jury also joins in. Judge Bumbleton states 'The court finds in favor of the bees!'. Barry states 'Vanessa, we won!' Vanessa says she knew they could do it, and she goes for a high five, but hits Barry because of her hand size. Barry says that he is ok. He states, 'You know what this means? All the honey will finally belong to the bees. Now we won’t have to work so hard all the time'. Montgomery states, 'This is an unholy perversion of the balance of nature, Benson. You'll regret this.' and then leaves the court room. As Barry is walking out of the courtroom he is being asked questions by reporters. One says 'Barry, how much honey is out there?' and he replies 'all right, one at a time'. Another reporter states 'Barry, who are you wearing?' and Barry states 'My sweater is Ralph Lauren, and I have no pants.' Adam and Vanessa stay behind. Adam questions 'What if Montgomery’s right?' and Vanessa asks what he means. Adam states that they have been living the bee way for a long time, 27 million years.", "connections": "This scene directly resolves the lawsuit and sets up the beginning of the next act. The judge’s ruling and the fact that he won, highlights that the bees and humans are now equals. Adam stating 'What if Montgomery’s right?' foreshadows the consequences to come."}
{"scene": 39, "summary": "A businessman congratulates Barry on his victory and asks what he is going to demand as a settlement. As he is talking we get a montage of the bee work camps being shut down and the bees being freed. He says they want back all of the honey and that the glorification of bears will stop and states they are 'filthy smelly bad-breath stink machines'. We then see Winnie the Pooh in cross hairs of a sniper rifle and is then taken out with a tranquilizer and his honey is taken. The sniper then states he will have nausea for a few hours then he will be fine. They then state that they will not tolerate bee-negative nicknames, and Mr. Sting is shown being taken out of his house, stating it’s just a prance about stage name. They will not tolerate the unnecessary inclusion of honey in bogus health products, and an old woman is pushed down and her honey is taken from her. Then a honey truck is shown dumping honey into the storage of the bee hive. Mr. Buzzwell states that they just passed 3 cups and there is gallons more coming, and they need to shut it down. Another bee states 'shut down, we have never shut down'. Buzzwell then says stop making honey and they then do, for the first time ever.", "connections": "This scene highlights the consequences of Barry’s actions and his plan for the settlement which he won. It also shows the beginning of the major change for the bee society and the start of their downfall with the honey production being shut down."}
{"scene": 40, "summary": "The scene starts with a bee about to jump into a pool of honey yelling 'cannon ball!' before getting stuck in the honey. There is a short montage of bees leaving their work and the Pollen Jocks getting a call and stating 'mission abort'. There is then a time lapse of Central Park wilting. Barry is talking to Adam, stating he wouldn't believe how much honey was out there. Adam asks 'Oh, yeah?' and Barry asks, 'What’s going on, where is everybody?' Adam states, 'they’re home, they don’t know what to do. Laying out, sleeping in'. He then mentions that Uncle Carl went to San Antonio with a cricket. Barry says, 'At least we got our honey back'. Adam then states 'Sometimes I think, so what if humans liked our honey, who wouldn’t? It’s the greatest thing in the world! I was excited to be part of making it! This was my new desk, this was my new job, I wanted to do it really well, and now… now I can’t'. The scene transitions to Barry and Vanessa talking on a roof. Barry states he doesn't understand why they aren’t happy. Vanessa states, 'You don’t have any idea what’s going on do you?'. Barry asks 'What did you want to show me?' and Vanessa points at her store, where all the flowers are wilting and grey. She then shows him Central Park, which is also grey and dying.", "connections": "This scene highlights the negative consequences of the bees’ freedom, which was a byproduct of Barry’s actions. The introduction of the failing flowers, creates a visual representation of the consequences of the bees not working."}
{"scene": 41, "summary": "Barry states 'Oh, no. Oh, my. They’re all wilting.' Vanessa says 'Doesn’t look very good, does it?' Barry replies, 'No'. She then asks, 'And whose fault do you think that is?' Barry states 'You know, I’m gonna guess bees'. Vanessa stares at him and says 'Bees?', and Barry says 'specifically, me'. He adds that he didn’t think the bees not making honey would affect all of this. Vanessa says, 'It’s not just flowers, fruits, vegetables, they all need bees'. Barry states 'That’s our whole SAT test right there'. Vanessa states that if you take away the produce, that affects the entire animal kingdom. Barry says 'And then, of course…the human species?' and Vanessa replies, 'So if there is no more pollination it could all just go south here, couldn't it?'. Vanessa states that she knows this is partly her fault as well. Barry asks about a suicide pact. Vanessa asks how they would do it, and Barry says he’d sting her and she’d step on him. Vanessa replies that that kills him twice. Vanessa says she has to get going. Barry asks where she is going. She states that she is going to the final Tournament of Roses parade in Pasadena because all the flowers are dying. Barry then states, 'Vanessa, I just wanna say I’m sorry, I never meant it to turn out like this'. Vanessa says 'I know, me neither', and then gets into a taxi. Barry states to himself, 'Tournament of Roses, Roses can’t do sports' before stating 'Wait a minute. Roses? Roses? Roses!'. He then yells, 'Vanessa!' and flies after the Taxi.", "connections": "This scene is where Barry is finally accepting responsibility for his actions and the consequences it had. The reveal of the dead flowers shows the impact of his choices. The ending of this scene sets up Barry’s new goal to fix his mistake, which will be the last conflict of the film."}
{"scene": 42, "summary": "Barry catches up to the taxi, Vanessa says, 'Roses?! Barry?'. Barry says that roses are flowers. Vanessa says yes, that’s why this is the last parade. Barry says maybe not, and asks her to ask the driver to slow down. Vanessa states, 'Could you slow down?' and the driver screeches to a halt. Barry then says that he made a huge mistake and it was a total disaster and all his fault. Vanessa states, 'yes, it kind of is.' Barry states that he ruined the planet, and that he just wanted to help her with her shop, but he made it worse. Vanessa states that it is completely closed down. Barry says, 'I thought maybe you were remodeling,' but he has another idea that is 'greater than all his other ideas combined.' Vanessa states that she doesn’t want to hear it. Barry then states, 'All right, they have the roses, the roses have the pollen. I know every bee, plant, and flower bud in this park. All we gotta do is get what they’ve got back here with what we’ve got. Bees'. Vanessa says, 'Park,' Barry says 'Pollen,' Vanessa says, 'Flowers,' Barry says, 'Re-pollination!' and Vanessa says 'Across the nation!'. Barry then says 'Tournament of Roses, Pasadena, California. They’ve got nothing but flowers, floats and cotton candy. Security will be tight.' Barry then states, 'I have an idea.' The scene then transitions to Vanessa at the airport to get on a plane filled with roses, and states her name and she is with the 'FTD official floral business', and she shows her badge, saying it’s real. A security guard states, 'Sorry ma’am, nice brooch,' and Vanessa says, 'thank you, it was a gift'. Barry is shown to be inside of the brooch. The scene then transitions to a flashback of Vanessa and Barry discussing the plan.", "connections": "This scene solidifies the relationship between Barry and Vanessa as they accept responsibility for their actions. It also shows Barry’s new direction, and how he will incorporate the help of other bees. This also shows a call back to scene 6 where Barry was wearing pollen. This is a turning point, where Barry now has a new plan that involves helping the entire world."}
{"scene": 43, "summary": "Barry and Vanessa are shown planning and discussing how they will get into the Tournament of Roses. Barry says once inside they will just pick the right float. Vanessa suggests the princess and the pea. Barry asks where he should sit and she replies it goes under the mattresses. The scene transitions back to the present and the security guard states 'Not in this fairy tale, sweetheart. I’m getting the marshal.' Vanessa then states 'You do that! This whole parade is a fiasco! Let’s see what this baby’ll do' and drives the float through the traffic. Barry states then all they have to do is blend in with traffic without arousing suspicion. He says that once they are at the airport there is no stopping them. The scene then transitions to Barry and Vanessa about to get on a plane. The security guard then states 'Stop! Security. You and your insect pack your float?' and she replies 'Yes'. The security guard then asks, 'Has it been in your possession the entire time?', to which she responds 'yes'. He then asks her to remove her shoes, and then jokes to Barry about removing his stinger. Barry says 'it’s a part of me', and the security guard says he’s just having some fun. The security guard then states, 'Enjoy your flight'. Barry then says 'Then if we’re lucky, we’ll have just enough pollen to do the job'. They are then on the plane, and Barry is talking about how lucky they are and that they have just enough pollen to do the job. Vanessa says she thinks that this is going to work and Barry replies 'It’s got to work'. The scene then cuts to the intercom where Captain Scott states they have a bit of bad weather in New York and that they have a couple hours of delay. Vanessa says that these are cut flowers without water and they’ll never make it. Barry states that he has to go talk to them. Vanessa tells him to be careful, and Barry flies out the cockpit door. Barry is then seen outside of the cockpit asking for help with a Sky Mall Magazine. A flight attendant opens the door and then Barry flies inside unseen. Barry then states, 'Captain, I’m in a real situation!'. The captain notices Barry and says, 'Bee!'. Barry states, 'No, no, no, don’t freak out!'. As the captain tries to suck Barry up with a vacuum, Hal asks, 'What are you doing?'. Barry then states, 'my entire species…'. The captain is still trying to vacuum him but instead, he sucks up Hal’s toupee and says 'Uh-oh'. Barry says 'wait a minute I’m an attorney!'. Hal states 'Who’s an attorney?' before the captain tries to hit Barry with the vacuum again, knocking Hal out, before he falls on the life raft button, which launches an inflatable raft into Scott, who then is knocked unconscious. Barry says to himself, 'Oh, Barry'.", "connections": "This scene sets up the journey to Pasadena and highlights how they are now working as a team. It also sets up the problem that arises with the pilots in the next scene, and their flight to Pasadena."}
{"scene": 44, "summary": "Barry, on the intercom with a southern accent, states that it’s the captain, and to have Vanessa in 24B report to the cockpit. Vanessa goes and finds the cockpit destroyed. Barry then states that he tried to talk to them, but there was a Dust Buster, a toupee, and a life raft exploded and that now one is bald, one’s in a boat, and they’re both unconscious. Vanessa states, 'is that another bee joke?' Barry states 'No! No one is flying the plane!'. Bud Ditchwater, from the JFK control tower, states 'This is JFK control tower, flight 356, what's your status?' Vanessa tells him that she’s a florist from New York and that the pilots are unconscious. Bud then states 'not good' and asks if anyone has flight experience. Barry says, 'as a matter of fact, there is', and Bud asks who that is. Barry then states, 'Barry Benson'. Bud then replies with 'From the honey trial?! Oh great'. Barry then tells Vanessa that this is nothing more than a big metal bee and that it’s got giant wings and huge engines, and that John Travolta is a pilot. Vanessa then says 'So it turns out I can not fly a plane'. A scene then shows a storm coming. The scene transitions to Bee News, where Bob Bumble states that Barry is attempting to land a plane with people, flowers, and an incapacitated flight crew. Janet, Martin, Uncle Carl, and Adam yell 'Flowers?!'. The scene then shows the human news with a reporter stating that there is a storm in the area and two people at the controls with no flight experience. Bud states, 'I’m quite familiar with Mr. Benson and his no-account compadres. They’ve done enough damage'. The reporter then says that he is their only hope. Bud states that bees shouldn’t be able to fly. Barry states 'Haven’t we heard this a million times? ‘The surface area of the wings and body mass make no sense.'", "connections": "This scene highlights that Barry has created another problem and sets up that now Vanessa has to fly the plane. It also shows that Barry is a bit of a celebrity and the bee and human world are watching his actions."}
{"scene": 45, "summary": "Barry is on the radio stating that the way they work may be a mystery to the humans, but making honey takes a lot of bees and small jobs, and that if you do a small job well, it can make a difference. He says that he wants to get the bees back to working together, and that it's the bee way, that they aren’t made of Jell-O, and they get behind a fellow. Barry then says, \"Black and yellow!\", and the other bees on the radio reply with \"Hello!\". The scene changes to Barry teaching Vanessa how to fly, stating \"left, right, down, hover\". Vanessa states \"Hover?\", and Barry states \"Forget hover\". Vanessa says this isn’t hard, and starts doing beeping noises. A lightning bolt hits the plane and the autopilot turns off, and Vanessa and Barry both panic. Vanessa states that she cannot fly a plane, and Barry asks \"Why not? Isn’t John Travolta a pilot?\" Vanessa says yes. They then both realize that they cannot fly a plane, and that the only way is for Vanessa to copy him. The plane starts to plummet, but then Lou Lu Duva is seen flying up with the Pollen Jocks and other bees, yelling \"All of you, let’s get behind this fellow! Move it out!\". Barry states \"Our only chance is if I do what I'd do, you copy me with the wings of the plane!\" He flies in front of Vanessa, and she states she doesn’t have to yell. They start yelling and slapping each other to \"snap out of it!\". They then both state \"Hold It!\". Vanessa asks how the plane is flying, and they realize they do not know. Barry states he has his antennae on \"call waiting\".", "connections": "This scene shows Barry taking control, and using his knowledge of bee society to help him in this new situation. It also introduces the Pollen Jocks again and the fact that the bees are now working together and supporting Barry."}
{"scene": 46, "summary": "Lou Lu Duva is heard saying, \"Benson, got any flowers for a happy occasion in there?\" Barry says they do get behind a fellow and Lou Lu says \"Black and yellow\" and the other bees yell hello. Lou says \"Alright, let’s drop this tin can on the blacktop.\" Barry then states \"Where? I can't see anything. Can you?\" Vanessa states \"No, nothing. It’s all cloudy. Come on, you got to think bee, Barry\". He then states \"thinking bee, thinking bee\", and on the runway it is shown that millions of bees are lying on their backs, making a large flower shape. A bee says \"Thinking bee\", over and over. Barry says that he thinks he’s feeling something, and that it's like a 27 million year old instinct. He tells Vanessa to bring the nose down. Vanessa states, \"What in the world is on the tarmac?\" and Bud says to get some lights on that. It is revealed that the bees are making a large pulsating flower. The bees all start chanting \"Thinking bee!\". Barry tells Vanessa to aim for the flower, and Vanessa states, \"Ok\". Barry says to cut the engines and they are going to use bee power and to get ready. He then says \"Good. Good. Easy, now. That's it. Land on that flower! Ready? Full reverse! Spin it around!\". Vanessa is seen attempting to fly but is struggling, as she gets closer to the runway. Barry states \"Not that flower! The other one!\". He then yells, \"That’s a fat guy in a flowered shirt. I mean the giant pulsating flower made of millions of bees!\" Barry says, \"Get your nose in there. Don’t be afraid. Smell it. Full reverse! Just drop it. Be a part of it. Aim for the center! Now drop it in! Drop it in, woman! Come on, already.\" The plane then lands safely, and the bees scatter. Vanessa and Barry both state \"We did it! You taught me how to fly!\" Barry says \"Yes!\" They almost high five, but then remember that they can't, and Vanessa says \"right\". Adam is there and states that it worked and asked if Barry saw the giant flower, to which Barry replies, \"What giant flower? Where? Of course I saw the flower! That was genius!\". Adam says thank you and Barry states, \"But we’re not done yet. Listen, everyone! This runway is covered with the last pollen from the last flowers available anywhere on Earth. That means this is our last chance. We’re the only ones who make honey, pollinate flowers and dress like this. If we’re gonna survive as a species, this is our moment! What do you say? Are we going to be bees or just a museum of natural history keychains?\".", "connections": "This scene is a culmination of all of Barry’s efforts and his reliance on his bee instincts. It is a metaphor for Barry finding his true potential, and having Vanessa with him to help guide the plane. The landing of the plane shows how the bees can work together to help fix the problem and his \"thinking bee\" statement helps Vanessa to fly the plane."}
{"scene": 47, "summary": "The scene shows a boy in a park stating that the bees are back. Adam is shown putting on the Krelman hat, and says \"If anyone needs to make a call, now’s the time. I got a feeling we’ll be working late tonight!\". The bee honey factories are shown back up and running. At Vanessa’s shop, she states to a customer \"Here’s your change, have a great afternoon! Can I help who’s next? Would you like some honey with that? It’s bee approved, don’t forget these\", she also gives them flowers. There is a room inside her shop where Barry is doing legal work, and he is currently with a cow. The cow is stating \"Milk, cream, cheese, it’s all me. And I don’t see a nickel! Sometimes I feel like a piece of meat!\" Barry states \"I had no idea\". Vanessa states she is sorry, and asks if he has a moment. Barry states, \"Would you excuse me, my mosquito associate will help you\". Mooseblood states he is sorry he’s late. The cow asks if he is a lawyer too, and Mooseblood states, \"Ma’am, I was already a blood-sucking parasite, all I needed was a briefcase\". Vanessa states \"Have a great afternoon! Barry, I just got this huge tulip order, and I can’t get them anywhere\". Barry replies with, \"No problem, Vannie, just leave it to me\". Vanessa thanks him, and asks \"Can I help who’s next?\". Barry then says \"All right, scramble, jocks! It’s time to fly!\". Vanessa thanks him as he leaves. As Ken is walking down the sidewalk he sees the sign \"bee approved honey\" at Vanessa’s shop and says \"That bee is living my life!\". Andy, who is walking beside him states, \"Let it go Kenny\". Ken states \"When will this nightmare end?\", and Andy states \"Let it all go\".", "connections": "This scene highlights that the world is back in balance, and that the bees are now doing what they are supposed to do. It also shows Barry as having found a way to use his newfound knowledge of the human world for good, and it brings back Mooseblood and shows the return of his normal life. It also highlights the ongoing struggle that Ken is facing, in that Barry has now completely taken over his life."}
{"scene": 48, "summary": "Barry is flying with a Pollen Jock and states \"Beautiful day to fly\" and the other pollen jock agrees. Barry then states, \"Between you and me, I was dying to get out of that office\". Barry is then shown flying through the box kite, and the film fades to black, and the credits begin. During the credits there are voices heard where it starts with \"You’ve got to start thinking bee my friend\", and other bees are saying \"thinking bee\" before Barry says \"Me?\". The singer then sings a song, and Barry interrupts, stating \"Hold it, let’s just stop for a second\". He then states \"I’m sorry, everyone, can we stop here\", and he says \"I’m not making a major life decision during a production number\". The singer states that it’s alright, and that everyone should wrap it up. Barry then states \"I had virtually no rehearsal for that.\"", "connections": "This scene is a call back to the very beginning of the movie and the scene where Barry flies through the box kite in the beginning. It shows that he has come full circle, and he has embraced both his love for adventure as well as his duty to his colony. The last part of the scene is a breaking of the fourth wall, in a comedic way, and solidifies that this movie is not meant to be taken seriously."}
